In [1]:
import pandas as pd
import numpy as np

## Reading and Writing Data in Text Format

1. **read_csv** read delimited data from a file, URL, or file-like object; comma as defaut delimiter
3. read_fwf read data in fixed width column format (no delimiter)
4. read_clipboard version of read_table that reads data from clipboard; useful for converting tables from web page
5. read_excel 
6. read_hdf, read hdf5 files written by pandas
7. read_html, read all tables found in the given html document
8. read_json, read from JSON
9. more read function please view the book and pandas documentation

## The mechanics to convert text data into a Dataframe
1. Indexing  
    Can treat one or more columns as the returned DataFrame, and whether to get
    column names from the file, the user, or not at all.
2. Type inference and data concersion  
    User-defined value conversions and custom list of missing value markers
3. Datetime parsing  
    Includes combining capability, including combining date and time information spread over multiple columns into a single column in the result
4. Iterating  
    Support for iterating over chunks of very large files
5. Unclean data issues
    Skipping rows or a footer, comments, or other minor things like numeric data with thousands separted by comma

In [9]:
path = 'Data/ch06/'
!cat Data/ch06/ex1.csv # cat will print the file on terminal

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
# the first way, allow pandas to assign the default column name
pd.read_csv('Data/ch06/ex1.csv', header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [4]:
# the second way is using names attribute to set the column name
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('Data/ch06/ex1.csv', names=names)

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [5]:
# set index as one columns
pd.read_csv('Data/ch06/ex1.csv', names=names, index_col='message')

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [6]:
# if you want to set a hierarchical index from multiple columns, just pass a list of
# column numbers or names
pd.read_csv('Data/ch06/csv_mindex.csv', index_col=['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [8]:
# In some cases,a table might not have a fixed delimiter, using whitespace or some other pattern
# to separate the fields. 
"""In this cases, you could pass a regular expression as a delimiter for read_csv"""
# Example
pd.read_csv('Data/ch06/ex3.txt', sep='\s+')
# it infers that the first column as index

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [13]:
# other parser function 
# skip rows function
pd.read_csv(path + 'ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

1. handle the missing value is very important in data preprocessing
2. Missing data is usually either not present (empty string) or marked by
some sentinel value. By default, pandas uses a set of commonly occurring sentinels,
such as NA and NULL

In [15]:
result = pd.read_csv(path + 'ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [16]:
result.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [19]:
# The na_values option can take either a list or set of strings to consider missing value
# Additional strings to recognize as NA/NaN. If dict passed, specific per-column NA values.  
pd.read_csv(path + 'ex5.csv', na_values = ['NULL'])

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
#Different NA sentinels can be specified for each column in a dict:
pd.read_csv(path + 'ex5.csv', na_values = {'message':['foo'], 'something' : ['two']})

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [ ]:
# View the book to check useful arguments

## Read Text files in Pieces
1. When processing very large files or figuring out the right set of arguments to cor‐
rectly process a large file, you may only want to read in a small piece of a file or iterate
through smaller chunks of the file.

In [25]:
# read only few rows
pd.options.display.max_rows = 10
pd.read_csv(path + 'ex6.csv', nrows=10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [74]:
# To read a file in pieces, specify a chunksize as a number of rows
chunker = pd.read_csv(path + 'ex6.csv', chunksize=1000)

In [75]:
chunker

In [76]:
# The TextParser object returned by read_csv allows you to iterate over the parts of
# the file according to the chunksize
# fill_value will fill existing missing (NaN) values, and any new element needed for 
# successful Series alignment
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [ ]:
tot = tot.sort_values(ascending=False)

### Why we need the sort to show the value???

In [79]:
tot[:10]

E    736.0
X    728.0
L    692.0
O    686.0
Q    680.0
M    676.0
J    674.0
F    670.0
K    668.0
H    660.0
dtype: float64

TextParser is also equipped with a get_chunk method that enables you to read
pieces of an arbitrary size.

## Save data into text file

In [82]:
data = pd.read_csv(path + 'ex5.csv')
data.to_csv(path + 'out.csv')

In [83]:
!cat Data/ch06/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [85]:
# print into console
import sys
data.to_csv(sys.stdout, sep=' ')
# Missing values appear as empty strings in the output. You might want to denote them
# by some other sentinel value:
data.to_csv(sys.stdout, sep='|', na_rep='NULL')

 something a b c d message
0 one 1 2 3.0 4
1 two 5 6  8 world
2 three 9 10 11.0 12 foo
|something|a|b|c|d|message
0|one|1|2|3.0|4|NULL
1|two|5|6|NULL|8|world
2|three|9|10|11.0|12|foo

In [87]:
# With no other options specified, both the row and column labels are written. Both of
# these can be disabled:
data.to_csv(sys.stdout, sep='|', na_rep='NULL', header=False, index=False)

one|1|2|3.0|4|NULL
two|5|6|NULL|8|world
three|9|10|11.0|12|foo

In [88]:
# also you could only write a subset of the columns and in an order of your choosing
data.to_csv(sys.stdout, sep='|', na_rep='NULL', index=False, columns=['b', 'c'])

b|c
2|3.0
6|NULL
10|11.0

In [90]:
# Series also has a method to write to csv
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv(sys.stdout)

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  after removing the cwd from sys.path.

## Working with Delimited Formats

In [100]:
# some manual processing may be necessary
# For any file with a single-character delimiter, you can use Python’s built-in csv modules
import csv
f = open(path + 'ex7.csv')
reader = csv.reader(f)

In [95]:
# Iterating through the reader like a file yields tuples of values with any quote characters 
# removed
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [98]:
# format the data example:
with open(path + 'ex7.csv') as f:
    lines = list(csv.reader(f))
# then we split the line into header and value
header, value = lines[0], lines[1:]
#we can create a dictionary of data columns using a dictionary comprehension and the expression
# zip(*values) , which transposes rows to columns:
data_dict = {h: v for h, v in zip(header, zip(*value))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

CSV files come in many different flavors. To define a new format with a different
delimiter, string quoting convention, or line terminator, we define a simple subclass
of csv.Dialect :

In [104]:
# example
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)

In [106]:
# how to write to csv manually 
with open(path + 'mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))

In [107]:
!cat Data/ch06/mydata.csv

one;two;three
1;2;3

## JSON data

In [108]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [112]:
import json
# read from json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [113]:
# write to json
json.dumps(result)

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

How you convert a JSON object or list of objects to a DataFrame or some other data
structure for analysis will be up to you. Conveniently, you can pass a list of dicts
(which were previously JSON objects) to the DataFrame constructor and select a sub‐
set of the data fields:

In [114]:
pd.DataFrame(result['siblings'], columns=['name', 'age'])

    name  age
0  Scott   30
1  Katie   38

In [122]:
# also you could use read_json to convert json to dataframeb
data = pd.read_json(path + 'example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [123]:
# export data to json
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

## HTML & XML
Python has many libraries for reading and writing data in the ubiquitous HTML and
XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is
comparatively much faster in general, the other libraries can better handle malformed
HTML or XML files.
pandas has a built-in function, read_html , which uses libraries like lxml and Beauti‐
ful Soup to automatically parse tables out of HTML files as DataFrame objects.

### Review the above lib when needed

In [126]:
from lxml.html import parse
import urllib3

### use pd.read_html

1. The pandas.read_html function has a number of options, but by default it searches
for and attempts to parse all tabular data contained within <table> tags. The result is
a list of DataFrame objects:

In [129]:
tables =pd.read_html(path + 'fdic_failed_bank_list.html')
failures = tables[0]

In [131]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [133]:
pd.to_datetime(failures['Closing Date']).dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

### Parsing XML with lxml.objectify
XML (eXtensible Markup Language) is another common structured data format sup‐
porting hierarchical, nested data with metadata.

In [134]:
# Using lxml.objectify , we parse the file and get a reference to the root node of the
# XML file with getroot :
from lxml import objectify
parsed = objectify.parse(path + 'mta_perf/Performance_MNR.xml')
root = parsed.getroot()

In [138]:
# root.INDICATOR returns a generator yielding each <INDICATOR> XML element.
data = []
for element in root.INDICATOR:
    el_data = {}
    for child in element.getchildren():
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [140]:
# convert the arry of dict to dataframe
perf = pd.DataFrame(data)

In [141]:
perf.head()

,AGENCY_NAME,CATEGORY,DECIMAL_PLACES,DESCRIPTION,DESIRED_CHANGE,FREQUENCY,INDICATOR_NAME,INDICATOR_SEQ,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PARENT_SEQ,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,1,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),28445,%,96.9,95,,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,1,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),28445,%,95,95,,2,2008,96,95
2,Metro-North Railroad,Service Indicators,1,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),28445,%,96.9,95,,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,1,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),28445,%,98.3,95,,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,1,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),28445,%,95.8,95,,5,2008,96.6,95

In [143]:
#You can now access any of the fields (like href ) in the tag or the link text:
root.get('CATEGORY')

## Read Binary Data

1. One of the easiest ways to store data (also known as serialization) efficiently in binary
format is using Python’s built-in pickle serialization.
2. pandas objects all have a
to_pickle method that writes the data to disk in pickle format
3. pickle is only recommended as a short-term storage format. The
problem is that it is hard to guarantee that the format will be stable
over time; an object pickled today may not unpickle with a later
version of a library. We have tried to maintain backward compati‐
bility when possible, but at some point in the future it may be nec‐
essary to “break” the pickle format

In [145]:
frame = pd.read_csv(path + 'ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [146]:
# to seriallization
frame.to_pickle(path + 'frame_pickle')

In [147]:
# You can read any “pickled” object stored in a file by using the built-in pickle directly,
# or even more conveniently using pandas.read_pickle :
pd.read_pickle(path + 'frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## Read HDF5

1. Hierarchical data format
2. Each HDF5 file can store multiple datasets and supporting metadata. Compared with simpler formats, HDF5 supports on-the-fly compression with a variety of compression modes, enabling data with repeated patterns to be stored more efficiently. HDF5 can be a good choice for working with very large datasets that don’t fit into memory, as you can efficiently read and write small sections of much larger arrays.
3. Using PyTables or h5py libraries
4. If you work with large quantities of data locally, I would encourage you to explore
PyTables and h5py to see how they can suit your needs. Since many data analysis
problems are I/O-bound (rather than CPU-bound), using a tool like HDF5 can mas‐
sively accelerate your applications.
5. HDF5 is not a database. It is best suited for write-once, read-many
datasets. While data can be added to a file at any time, if multiple
writers do so simultaneously, the file can become corrupted.

In [151]:
# use pandas to store series and dataframe object into HDF5
frame = pd.DataFrame({'a' : np.random.randn(100)})
store = pd.HDFStore('mydata.h5')

In [152]:
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [153]:
# Objects contained in the HDF5 file can then be retrieved with the same dict-like API:
store['obj1']

           a
0  -1.236698
1   1.344997
2   0.554317
3   1.021467
4   1.339715
..       ...
95 -1.720940
96 -0.714491
97 -0.387938
98 -0.398386
99  0.556152

[100 rows x 1 columns]

In [154]:
# HDFStore supports two storage schemas, 'fixed' and 'table' . The latter is generally
# slower, but it supports query operations using a special syntax:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -1.495721
11 -0.414093
12  0.178576
13  0.379988
14  0.174350
15  1.436861

## Interacting with Web APIs
1. There are a number of ways to access these APIs from Python; one easy-to-use
method that I recommend is the requests package.

In [155]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)

In [156]:
resp

In [158]:
# The Response object’s json method will return a dictionary containing JSON parsed into 
#native Python objects:
data = resp.json()

In [159]:
data[0]['title']

'Using corr with callable gives 1 on diagonals where the result should be NaN'

In [160]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues

,number,title,labels,state
0,25781,Using corr with callable gives 1 on diagonals ...,[],open
1,25780,PERF: Improve performance of StataReader's pro...,"[{'id': 104865385, 'node_id': 'MDU6TGFiZWwxMDQ...",open
2,25778,CI: downstream tests failing due to environmen...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
3,25777,Summing a sparse boolean series throws an exce...,[],open
4,25776,fix length_of_indexer to handle boolean array ...,[],open
...,...,...,...,...
25,25746,BUG: Fix localize_pydatetime using meta dateti...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,25745,BUG: Display precision doesn't affect complex ...,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
27,25744,Series.update fails with categorical types,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,25743,BUG: Fix groupby with MultiIndex Series corner...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,25738,Dropna argument is now respected when false in...,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open

## Interacting with DB

In [161]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL, d INTEGER);
"""
con = sqlite3.connect(':memory:')

In [162]:
con.execute(query)
con.commit()

In [165]:
# add data 
data = [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES (?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [166]:
cursor = con.execute('SELECT * FROM test')

In [168]:
row = cursor.fetchall()

In [169]:
row

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]